app/views/users/show.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."secret_id" = $1  [["secret_id", 8]]
---
    <li><%= secret.content%>
    <p><%= secret.likes.count %>Likes</p>