app/views/secrets/index.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."secret_id" = $1  [["secret_id", 1]]
---
    <p>
        <%= secret.likes.count %>Likes

SELECT  1 AS one FROM "secrets" INNER JOIN "likes" ON "secrets"."id" = "likes"."secret_id" WHERE "likes"."user_id" = $1 AND "secrets"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 1], ["LIMIT", 1]]
SELECT "secrets".* FROM "secrets" INNER JOIN "likes" ON "secrets"."id" = "likes"."secret_id" WHERE "likes"."user_id" = $1  [["user_id", 4]]
---
                            <% else %>
                                <% if current_user.secrets_liked.include? secret %>