app/views/secrets/new.html.erb

    <li><%= secret.content%>
    <p><%= secret.likes.count %>Likes</p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."secret_id" = $1  [["secret_id", 1]]