app/controllers/likes_controller.rb

SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "secret_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["secret_id", 1], ["created_at", 2021-02-24 16:37:37 UTC], ["updated_at", 2021-02-24 16:37:37 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."secret_id" = $2 LIMIT $3  [["user_id", 4], ["secret_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."secret_id" = $1 AND "users"."id" = $2 LIMIT $3  [["secret_id", 3], ["id", 4], ["LIMIT", 1]]
---
      def create
        secret = Secret.find(params[:id])
        Like.create(user_id:current_user.id,secret_id: params[:id]) unless secret.liked.include? current_user

SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."secret_id" = 14 AND "likes"."user_id" = 4 LIMIT $1  [["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
      def destroy
        secret = Secret.find(params[:id])
        puts secret
        like =Like.find_by(secret:secret,user:current_user)
        puts 'deleting a like'
        puts like
        like.delete unless like === nil