app/controllers/secrets_controller.rb

  def index
    @secrets = Secret.all
---
SELECT "secrets".* FROM "secrets"

  def new
    @secrets = Secret.all
---
SELECT "secrets".* FROM "secrets"

  def show
    @secrets = Secret.find(params[:id])
---
SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def create
    @secret = Secret.create(secret_params)
    @secret.user = current_user
    if @secret.save
---
INSERT INTO "secrets" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "me gusta comer helados de papa"], ["created_at", 2021-02-23 22:41:49 UTC], ["updated_at", 2021-02-23 22:41:49 UTC]]
UPDATE "secrets" SET "user_id" = $1, "updated_at" = $2 WHERE "secrets"."id" = $3  [["user_id", 3], ["updated_at", 2021-02-23 22:41:49 UTC], ["id", 1]]

  def delete
    @secrets  = Secret.find(params[:id])
    @secrets.delete if @secrets.user == current_user
---
SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "secrets" WHERE "secrets"."id" = $1  [["id", 5]]